ingestion-api/perf/wrk2/2015-03-17-v010s-perf-1event-output.txt
# Running on laptop
#  - 2.6GHz Quad-core Intel Core i7, 16GB 1600MHz DDR3L SDRAM
#  - ingestion-api on host (no docker)
#  -  {:server {:port 9000 :auto-reload true}
#      :backend {:type :kafka :topic "events" :metadata.broker.list "192.168.59.103:49154"}}
#  - kafka backend with 3 brokers in docker
#  - 1 topic 1 partition

Running 50s test @ http://127.0.0.1:9000/v1/events
  5 threads and 100 connections
  Thread calibration: mean lat.: 1.421ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.407ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.545ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.418ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.435ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.46ms  632.30us  17.65ms   71.86%
    Req/Sec   421.15     84.00     1.11k    72.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.40ms
 75.000%    1.80ms
 90.000%    2.22ms
 99.000%    3.30ms
 99.900%    5.28ms
 99.990%    7.92ms
 99.999%   17.12ms
100.000%   17.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.307     0.000000            1         1.00
       0.729     0.100000         8005         1.11
       0.929     0.200000        15991         1.25
       1.097     0.300000        23964         1.43
       1.252     0.400000        31956         1.67
       1.397     0.500000        39908         2.00
       1.470     0.550000        43930         2.22
       1.546     0.600000        47885         2.50
       1.625     0.650000        51890         2.86
       1.709     0.700000        55862         3.33
       1.805     0.750000        59878         4.00
       1.856     0.775000        61850         4.44
       1.914     0.800000        63860         5.00
       1.977     0.825000        65840         5.71
       2.047     0.850000        67839         6.67
       2.127     0.875000        69852         8.00
       2.171     0.887500        70842         8.89
       2.221     0.900000        71828        10.00
       2.275     0.912500        72823        11.43
       2.339     0.925000        73812        13.33
       2.419     0.937500        74819        16.00
       2.469     0.943750        75310        17.78
       2.521     0.950000        75807        20.00
       2.579     0.956250        76314        22.86
       2.647     0.962500        76809        26.67
       2.727     0.968750        77302        32.00
       2.779     0.971875        77553        35.56
       2.831     0.975000        77802        40.00
       2.899     0.978125        78050        45.71
       2.973     0.981250        78299        53.33
       3.067     0.984375        78552        64.00
       3.125     0.985938        78674        71.11
       3.187     0.987500        78799        80.00
       3.253     0.989062        78924        91.43
       3.341     0.990625        79047       106.67
       3.453     0.992188        79171       128.00
       3.525     0.992969        79234       142.22
       3.625     0.993750        79296       160.00
       3.727     0.994531        79358       182.86
       3.861     0.995313        79420       213.33
       4.025     0.996094        79485       256.00
       4.115     0.996484        79514       284.44
       4.239     0.996875        79545       320.00
       4.339     0.997266        79576       365.71
       4.487     0.997656        79607       426.67
       4.659     0.998047        79639       512.00
       4.763     0.998242        79654       568.89
       4.863     0.998437        79670       640.00
       5.003     0.998633        79685       731.43
       5.135     0.998828        79701       853.33
       5.307     0.999023        79717      1024.00
       5.399     0.999121        79724      1137.78
       5.583     0.999219        79732      1280.00
       5.731     0.999316        79740      1462.86
       5.923     0.999414        79748      1706.67
       6.139     0.999512        79756      2048.00
       6.319     0.999561        79759      2275.56
       6.535     0.999609        79763      2560.00
       6.607     0.999658        79767      2925.71
       6.827     0.999707        79771      3413.33
       7.079     0.999756        79775      4096.00
       7.323     0.999780        79777      4551.11
       7.363     0.999805        79779      5120.00
       7.475     0.999829        79781      5851.43
       7.523     0.999854        79783      6826.67
       7.919     0.999878        79786      8192.00
       7.919     0.999890        79786      9102.22
       8.179     0.999902        79787     10240.00
       8.575     0.999915        79788     11702.86
       8.711     0.999927        79789     13653.33
       8.879     0.999939        79790     16384.00
       8.879     0.999945        79790     18204.44
      12.695     0.999951        79791     20480.00
      12.695     0.999957        79791     23405.71
      13.167     0.999963        79792     27306.67
      13.167     0.999969        79792     32768.00
      13.167     0.999973        79792     36408.89
      17.119     0.999976        79793     40960.00
      17.119     0.999979        79793     46811.43
      17.119     0.999982        79793     54613.33
      17.119     0.999985        79793     65536.00
      17.119     0.999986        79793     72817.78
      17.663     0.999988        79794     81920.00
      17.663     1.000000        79794          inf
#[Mean    =        1.460, StdDeviation   =        0.632]
#[Max     =       17.648, Total count    =        79794]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  99950 requests in 50.00s, 9.44MB read
Requests/sec:   1998.96
Transfer/sec:    193.26KB